[
  {
    "name": "Young Americans",
    "audioUrl": "https://youtu.be/ScVi_L817ec",
    "length": "5:11",
    "genre": "soul",
    "description": "The first studio result of Bowie's mid-1970s obsession with soul music, 'Young Americans' was a breakthrough for the artist in the United States (where the single was released in an edited 3:11 version). The sound, later described by Bowie as 'plastic soul', was matched by a cynical lyric, making references to McCarthyism, black repression via Rosa Parks, Richard Nixon (who resigned the US presidency two days before the recording session), and a near-direct lift from the Beatles’ 'A Day in the Life' with the line 'I heard the news today oh boy!' (John Lennon, who wrote that line, appeared twice on the Young Americans album, providing guitar and backing vocals on his own 'Across the Universe' and 'Fame', for which he also received a co-writing credit). The backing vocal arrangement was suggested by Luther Vandross. 'Americans', noted production team The Matrix, 'is a bit like a teenager: brimming with energy and imagination, occasionally overstepping the mark, but always with a great sense of possibility. Bowie captured a big piece of that in 'Young Americans'.",
    "source": "https://en.wikipedia.org/wiki/Young_Americans_(song)",
    "releaseDate": "02-21-1975",
    "songwriter": "David Bowie",
    "single": true,
    "bowie": "Plastic Soul",
    "album": "Young Americans"
  },
  {
    "name": "Win",
    "audioUrl": "",
    "length": "4:44",
    "genre": "soul",
    "description": "",
    "source": "https://en.wikipedia.org/wiki/Young_Americans",
    "releaseDate": "02-21-1975",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Plastic Soul",
    "album": "Young Americans"
  },  {
    "name": "Fascination",
    "audioUrl": "",
    "length": "5:45",
    "genre": "soul",
    "description": "'Fascination' is a song written by English singer and songwriter David Bowie and American musician Luther Vandross for Bowie's Young Americans album in 1975. The song originated from a Vandross song called 'Funky Music' which The Mike Garson Band used to play before Bowie concerts in 1974. An alternate mix appeared on the 1989 Sound + Vision box set, though this was replaced with the original on the 2003 reissue of the compilation. While Bowie never performed this track live in concert, it was rehearsed for potential inclusion in Bowie's set at the 1985 London Live Aid concert, though, along with 'China Girl,' it was eventually dropped from his final set list. \nThe song is played on the fictional radio station Liberty Rock Radio, hosted by Bowie's former collaborator Iggy Pop, on the 2008 video game Grand Theft Auto IV. This is also the second Grand Theft Auto game, after Grand Theft Auto: San Andreas, to feature a track from the Young Americans album (Grand Theft Auto: San Andreas features the track 'Somebody Up There Likes Me' on the fictional radio station K-DST).",
    "source": "https://en.wikipedia.org/wiki/Fascination_(David_Bowie_song)",
    "releaseDate": "02-21-1975",
    "songwriter": "David Bowie, Luther Vandross",
    "single": false,
    "bowie": "Plastic Soul",
    "album": "Young Americans"
  },  {
    "name": "Right",
    "audioUrl": "",
    "length": "4:15",
    "genre": "blue-eyed soul, funk",
    "description": "The repetition of the main lyrics—'Taking it all the right way / Never no turning back'—the prominence of the percussion and bass, and the emphasis on the backing singers made 'Right' one of the album's 'authentically soulful' songs, according to professor of music Ian Chapman. Chapman describes it as having 'no hidden Bowie-esque irony, barb, or angst', although Alex Petridis calls it a 'twitchy, agitated note-to-self'. The backing vocalists included Luther Vandross and an old friend of Bowie's, Geoff MacCormack; it was the only track on Young Americans to feature MacCormack. The call and response between Bowie and the backing singers 'lends an air of immaculate sophistication to the lyric's paean to positive thinking', according to Nicholas Pegg. In 1975 Bowie called the song a mantra: 'People forget what the sound of Man's instinct is—it's a drone, a mantra. And people say, 'Why are so many things popular that just drone on and on?' But that's the point really. It reaches a particular vibration, not necessarily a musical level.' Toward the end of Alan Yentob's film about Bowie, Cracked Actor (1975), Bowie, Luther Vandross, Robin Clark and Ava Cherry are seen rehearsing 'Right' for the 1974 'Soul Tour', although in the end it was never performed live.",
    "source": "https://en.wikipedia.org/wiki/Right_(David_Bowie_song)",
    "releaseDate": "02-21-1975",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Plastic Soul",
    "album": "Young Americans"
  },  {
    "name": "Somebody Up There Likes Me",
    "audioUrl": "",
    "length": "6:36",
    "genre": "soul",
    "description": "",
    "source": "https://en.wikipedia.org/wiki/Young_Americans",
    "releaseDate": "02-21-1975",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Plastic Soul",
    "album": "Young Americans"
  },  {
    "name": "Across the Universe",
    "audioUrl": "https://www.youtube.com/watch?v=DvfHO8-w6CY",
    "length": "4:29",
    "genre": "",
    "description": "Bowie’s cover of John Lennon’s “Across the Universe” was a blatant, and successful, attempt to lure Lennon into the studio. Bowie and Lennon had first met in late 1974 at a small party in Bowie’s New York hotel suite. The two didn’t converse for hours until, cocaine- and Cognac-fueled, they began sketching caricatures of each other on notepads. Tony Visconti (who met his future wife, Lennon’s then-girlfriend May Pang, that night) recalled that the party ended with everyone in the room getting into “a dismally dark conversation about ‘what does it all mean,’ ‘it’ being life, which left us all staring dejectedly at the floor.",
    "source": "https://bowiesongs.wordpress.com/2010/11/17/across-the-universe/",
    "releaseDate": "02-21-1975",
    "songwriter": "John Lennon, Paul McCartney",
    "single": false,
    "bowie": "Plastic Soul",
    "album": "Young Americans"
  },  {
    "name": "Can You Hear Me?",
    "audioUrl": "",
    "length": "5:03",
    "genre": "soul",
    "description": "'Can You Hear Me?' is a ballad by David Bowie from his 1974 album Plastic Soul, released in 2016, and his 1975 album Young Americans, released in March that year.[1] Bowie called it a 'real love song', written with someone in mind, but he did not identify them.[2] It was released as a single in November 1975 on the B side of Golden Years. Chris O'Leary writes that 'Can You Hear Me?', with its guilt and 'studied unease', is 'sumptuous, its intro alone masterful': 'Once we were lovers / Can they understand? / Closer than others, I was your / I was your man.' The alto sax, played by David Sanborn and introduced in the third verse, 'becomes a competing vocal line'. The arrangement and 'small cathedral of voices' obscure the 'pathetic man at the heart of the song'. The song was written by Bowie, produced by Bowie, Tony Visconti, and Harry Maslin, and engineered by Carl Paruolo. The backing vocalists included the 24-year-old Luther Vandross at the very beginning of his career.",
    "source": "https://en.wikipedia.org/wiki/Can_You_Hear_Me%3F_(David_Bowie_song)",
    "releaseDate": "02-21-1975",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Plastic Soul",
    "album": "Young Americans"
  },  {
    "name": "Fame",
    "audioUrl": "",
    "length": "4:16",
    "genre": "soul",
    "description": "With the release of his 1972 album The Rise and Fall of Ziggy Stardust and the Spiders from Mars, Bowie achieved stardom. On that album, Bowie presented his aspirations to become famous in 'Star', which also encapsulated the fantasies of 'every adolescent dreamer miming into a hairbrush in a suburban bedroom', on top of Bowie's own frustration with not having fulfilled his potential. By the beginning of 1975, 'fame' meant a couple of different things to Bowie. It meant not only his stardom, but also impending lawsuits that were the result of the ending of Bowie's relationship with his manager Tony Defries. \nIt also meant an expensive musical theatre project concocted by Defries, titled Fame, that was financed through MainMan, a company that was built around Bowie's fame; the show was an examination of Marilyn Monroe that closed after one night on Broadway and after already flopping off-Broadway. The failure of Fame almost ruined MainMan and was traumatic on Bowie and Defries' relationship. \nBowie would later describe 'Fame' as 'nasty, angry', and fully admitted that it was written 'with a degree of malice' aimed at the MainMan. This is supported by biographer Peter Doggett, who writes: 'every time in 'Fame' that Bowie snapped back with a cynical retort about its pitfalls, he had [Defries] and [Defries's] epic folly in mind,' and noted the lyric 'bully for you, chilly for me' as the striking example. \nIn 1990, Bowie recalled the song as his 'least favourite track on the album' and reflected: 'I'd had very upsetting management problems and a lot of that was built into the song. I've left all that behind me, now... I think fame itself is not a rewarding thing. The most you can say is that it gets you a seat in restaurants.'",
    "source": "https://en.wikipedia.org/wiki/Fame_(David_Bowie_song)",
    "releaseDate": "02-21-1975",
    "songwriter": "David Bowie, Carlos Alomar, John Lennon",
    "single": true,
    "bowie": "Plastic Soul",
    "album": "Young Americans"
  },  {
    "name": "Station to Station",
    "audioUrl": "",
    "length": "10:15",
    "genre": "art rock",
    "description": "At over 10 minutes in length, it is Bowie's longest studio recording. It introduces Bowie's persona the Thin White Duke, a sinister figure who became the mouthpiece for Station to Station and, often throughout 1976, for Bowie himself.[4][5] The persona was noticably darker than Bowie's previous characters, being described as 'a mad aristocrat', an 'amoral zombie', and 'an emotionless Aryan superman'. For Bowie himself, the Duke was 'a nasty character indeed'. The lyrics also contain various references to Aleister Crowley, who was previously mentioned by Bowie on the Hunky Dory track 'Quicksand', the 13th century Jewish mystical system known as the Kabbalah and gnosticism.",
    "source": "https://en.wikipedia.org/wiki/Station_to_Station_(song)",
    "releaseDate": "01-23-1976",
    "songwriter": "David Bowie",
    "single": true,
    "bowie": "The Thin White Duke",
    "album": "Station to Station"
  },  {
    "name": "Golden Years",
    "audioUrl": "https://www.youtube.com/watch?v=HRD0ghlFSgk",
    "length": "3:59",
    "genre": "art rock",
    "description": "Bowie's ex-wife Angela claims this was written for her. Bowie does appear to be addressing someone specific in this song, encouraging them to revel in their 'golden years': 'Don't let me hear you say life's taking you nowhere, angel, come get up my baby, look at that sky, life's begun, nights are warm and the days are young.' Bowie wrote this with the intention of giving it to Elvis Presley, but he reportedly refused the song. Elvis died two years later. Bowie made an appearance on Soul Train singing (actually, lip synching) 'Golden Years' and 'Fame' on November 4, 1975. Few white performers had appeared on the show, but host Don Cornelius gave him a warm welcome, introducing him as 'one of the world’s most popular and important music personalities.' For Bowie, Soul Train was a big deal because he grew up listening to many of the American R&B who appeared on the show. He was nervous, and reportedly got a little drunk beforehand to take the edge off; footage does appear to show him stumbling over his lyrics.",
    "source": "https://www.songfacts.com/facts/david-bowie/golden-years",
    "releaseDate": "01-23-1976",
    "songwriter": "David Bowie",
    "single": true,
    "bowie": "The Thin White Duke",
    "album": "Station to Station"
  },  {
    "name": "Word on a Wing",
    "audioUrl": "",
    "length": "6:04",
    "genre": "art rock",
    "description": "'Word on a Wing' is a song written and recorded by English singer-songwriter David Bowie in 1975 for the Station to Station album, where it appears as the closing track of the LP's first side. Bowie admits that the song was written out of a coke-addled spiritual despair that he experienced while filming the movie The Man Who Fell To Earth. In 1980 Bowie spoke of the song to NME, claiming 'There were days of such psychological terror when making the Roeg film that I nearly started to approach my reborn, born again thing. It was the first time I'd really seriously thought about Christ and God in any depth, and 'Word on a Wing' was a protection. It did come as a complete revolt against elements that I found in the film. The passion in the song was genuine... something I needed to produce from within myself to safeguard myself against some of the situations I felt were happening on the film set.'",
    "source": "https://en.wikipedia.org/wiki/Word_on_a_Wing",
    "releaseDate": "01-23-1976",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "The Thin White Duke",
    "album": "Station to Station"
  },  {
    "name": "TVC 15",
    "audioUrl": "",
    "length": "5:31",
    "genre": "art rock",
    "description": "'TVC 15' is a song written and recorded by singer-songwriter David Bowie and released on his 1976 album Station to Station. The track was inspired by an episode in which Iggy Pop, during a drug-fueled period at Bowie's LA home, hallucinated and believed the television set was swallowing his girlfriend.[2] Bowie developed a story of a holographic television, TVC 15. In the song, the narrator's girlfriend crawls into the television and afterwards, the narrator desires to crawl in himself to find her. It has been called 'incongruously jolly' and 'the most oblique tribute to the Yardbirds imaginable.'",
    "source": "https://en.wikipedia.org/wiki/TVC_15",
    "releaseDate": "01-23-1976",
    "songwriter": "David Bowie",
    "single": true,
    "bowie": "The Thin White Duke",
    "album": "Station to Station"
  },  {
    "name": "Stay",
    "audioUrl": "https://www.youtube.com/watch?v=_DanDvAfCcs",
    "length": "6:16",
    "genre": "art rock",
    "description": "",
    "releaseDate": "01-23-1976",
    "songwriter": "David Bowie",
    "single": true,
    "bowie": "The Thin White Duke",
    "album": "Station to Station"
  },  {
    "name": "Wild is the Wind",
    "audioUrl": "",
    "length": "6:06",
    "genre": "art rock",
    "description": "This song was written by Dimitri Tiomkin and Ned Washington and originally recorded by Johnny Mathis for the 1957 film Wild Is The Wind. The tune proved to be very popular peaking at #22 on the US singles chart and receiving a nomination for an Academy Award. Nina Simone recorded the song in a very low key as the title track for an album she released in 1966. Bowie was an admirer of Simone's style, and after meeting her in Los Angeles he was inspired to record the pop/jazz tune as the concluding number for Station to Station. Five years later he released it as the lead single from his compilation album",
    "source": "https://www.songfacts.com/facts/david-bowie/wild-is-the-wind",
    "releaseDate": "01-23-1976",
    "songwriter": "Ned Washington, Dimitri Tiomkin",
    "single": true,
    "bowie": "The Thin White Duke",
    "album": "Station to Station"
  },  {
    "name": "Five Years",
    "audioUrl": "",
    "length": "4:42",
    "genre": "glam rock",
    "description": "Perhaps one of the best album openers of all time, “Five Years” crescendos beautifully. A sparse fade in introduces a few verses set to piano, chronicling the panic that accompanies news of Earth’s imminent demise. Bowie crams in details, mostly focusing on the people. Then it soars and becomes a love song, with Bowie’s narrator desperately clinging to the memory of a lost love as he comes to terms with his mortality. The stage is set for Ziggy’s entrance.",
    "source": "https://genius.com/David-bowie-five-years-lyrics",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Soul Love",
    "audioUrl": "",
    "length": "3:34",
    "genre": "glam rock",
    "description": "'Soul Love' features three scenes, each presenting a different facet of human love and the consequences for those involved. Bowie terms these forms as Stone Love, New Love, & Soul Love. Interestingly, the characters in each scene come to discover their new and challenging relationships to love through the medium of human language. The often cruel juxtaposition of 'words' to 'love' provides the central theme of Soul Love. \nParental/Maternal love (Stone Love) is presented as a mother kneeling before the grave of her son who 'gave his life to save the slogans.' In this case language literally 'hovers between the headstone and her eyes' forming an actual barrier between herself and her son. \nRomantic/Sexual love (New Love) appears as a force so intimate and powerful that for those so affected it literally 'tears their hearts.' For our young lovers, the strength and intimacy of this new bond is manifested as 'new words that only they can share in.' In this case, the same force that bonds the lovers together acts to isolate them from the body of humanity proper. \nReligious/Spiritual love (Soul Love), is touted as a universal force by a priest who can 'taste the word.' The priest's words, however, far from revealing any actual universal truth, are simply part of the process by which the narrator's 'loneliness evolves.'",
    "source": "https://phish.net/song/soul-love/history",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Moonage Daydream",
    "audioUrl": "",
    "length": "4:40",
    "genre": "glam rock",
    "description": "'Moonage Daydream' is a song written by David Bowie in 1971, first released as a single with the band Arnold Corns. A re-recorded version, featuring Bowie and his band The Spiders from Mars, was released in 1972 on The Rise and Fall of Ziggy Stardust and the Spiders from Mars. \nThe song tells of an alien messiah and hints at his destiny to save the world from the impending disaster described in Bowie's 'Five Years', as well as his fate as the quintessential 'soul lover'. 'With Bowie, you're spoilt for choice when it comes to sci-fi-inspired songs,' observed Tim Wheeler of Ash. 'But 'Moonage Daydream' is my favourite. It's got a great riff and it sounds really pretty in a weird kind of way, even though the lyrics are quite dark.' \nIn the story arc of The Rise and Fall of Ziggy Stardust and the Spiders from Mars, this is one of the most important songs. It describes the creation of Ziggy from a combination of religion, romance, sexual freedom, rebellion, and passion; he metamorphoses into the archetypal rock star.",
    "source": "https://en.wikipedia.org/wiki/Moonage_Daydream",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Starman",
    "audioUrl": "",
    "length": "4:10",
    "genre": "glam rock",
    "description": "The lyrics describe Ziggy Stardust bringing a message of hope to Earth's youth through the radio, salvation by an alien 'Starman'. The story is told from the point of view of one of the youths who hears Ziggy. According to Bowie himself, speaking to William S. Burroughs for Rolling Stone magazine in 1973, Ziggy Stardust is not the Starman but merely his earthly messenger – contrary to received opinion which often paints Ziggy as an extraterrestrial. The song has inspired interpretations ranging from an allusion to the Second Coming of Christ, to an accurate prediction of the plot for the film Close Encounters of the Third Kind (1977).",
    "source": "https://en.wikipedia.org/wiki/Starman_(song)",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": true,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "It Ain't Easy",
    "audioUrl": "2:58",
    "length": "",
    "genre": "glam rock",
    "description": "It Ain’t Easy' was written by the American songwriter Ron Davies, who was born in Louisiana and grew up in the Pacific Northwest. At age 20, he was signed to A&M Records and in 1970 released Silent Song Through the Land, from which the song comes. \n It’s unclear how Bowie picked up 'It Ain’t Easy'; some biographers have claimed Mick Ronson had been playing it with his old band The Rats. It wasn’t that obscure a song, in any event: both Three Dog Night and Long John Baldry had already covered it, and Dave Edmunds soon would. Bowie first played 'It Ain’t Easy' in his glam hootenanny BBC session of June 1971, and the song worked well as a finale: the singers taking turns on the verses, uniting in the song’s cavernous, gospel-inspired chorus. The ramshackle performance was in line with the other rock & roll circuses of the period, like Delaney and Bonnie’s groups or Joe Cocker’s Mad Dogs & Englishmen Revue. \nBowie went on to cut a studio version of the song a month later, and used it to close the first side of Ziggy Stardust, an alleged concept record in which it has no discernible role. Maybe he just loved Ronson’s fine slide guitar on the track, or thought the song’s simplicity (it’s mainly just two chords, D and A, with a C thrown in during the choruses) and rock & roll cliches (we get “satisfaction” and a 'hoochie coochie woman' in the same verse) gave the LP some ballast. Still, the fact that it made the cut for Ziggy while 'Velvet Goldmine' and 'Sweet Head' were axed remains one of the minor mysteries of Bowie’s career.",
    "source": "https://bowiesongs.wordpress.com/2010/03/11/it-aint-easy/",
    "releaseDate": "06-16-1972",
    "songwriter": "Ron Davies",
    "single": false,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Lady Stardust",
    "audioUrl": "",
    "length": "3:22",
    "genre": "glam rock",
    "description": "Lady Stardust acts as both a tongue-in-cheek tribute to Marc Bolan and an account of Ziggy Stardust’s musical and artistic inspiration. The song describes an androgynous man, desired by men and women alike, who was well ahead of his time, similar to both Bowie and Ziggy. \nWhile some may hastily assume that Bowie is taking a jab at Bolan, the two were actually good friends.",
    "source": "https://genius.com/David-bowie-lady-stardust-lyrics",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Star",
    "audioUrl": "",
    "length": "2:47",
    "genre": "glam rock",
    "description": "One of the many songs on Ziggy Stardust that references the star concept in one way or another. “Star” is the most bluntly titled of the bunch, with David Bowie tackling the desire to be such a thing in a series of quick character sketches. \nIn the context of the album, Ziggy is realizing that the best way to save the world may be “As a rock & roll star.”",
    "source": "https://genius.com/David-bowie-star-lyrics",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Hang On To Yourself",
    "audioUrl": "",
    "length": "2:40",
    "genre": "glam rock",
    "description": "Hang on to Yourself is the 8th track off of The Rise and Fall of Ziggy Stardust and The Spiders from Mars. \nIt was originally written in 1971 by David and released as a single under the name “Arnold Corns”. Although the single flopped, the song was revived by Bowie for the Ziggy sessions and fit well into the album’s story line. \nMany people would cite the guitar riffs, tempo and attitude as one of the earliest examples of Punk Rock (Proto-Punk as some like to call it). \nGlen Matlock of The Sex Pistols stated that this track was one of the inspirations for their iconic Punk Rock track, “God Save The Queen”.",
    "source": "https://genius.com/David-bowie-hang-on-to-yourself-lyrics",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Ziggy Stardust",
    "audioUrl": "",
    "length": "3:13",
    "genre": "glam rock",
    "description": "This song is from the perspective of the Spiders from Mars, Ziggy’s band. It shows the animosity that arises between Ziggy and the group, as Ziggy grows more and more popular, pushing them to the shadows as he gets the spotlight. \nThis track may be described as the climax of David Bowie’s astonishing reinvention as a mythical rock & roll messiah, Ziggy Stardust. This song, taken from his still famous 1972 breakthrough album, has been cloned, redone, borrowed from, and revisited so many times, that now trying to describe its impact becomes nearly impossible.",
    "source": "https://genius.com/David-bowie-ziggy-stardust-lyrics",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": false,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Suffragette City",
    "audioUrl": "",
    "length": "3:25",
    "genre": "glam rock",
    "description": "Suffragette City is a song by English singer-songwriter David Bowie. It was originally released as the B-side to 'Starman' in April 1972 and subsequently appeared on his 1972 album The Rise and Fall of Ziggy Stardust and the Spiders from Mars. It was later issued as a single in 1976 to promote the Changesonebowie compilation in the UK, with the US single edit of 'Stay' as the B-side. The single failed to chart. \nRecorded on 4 February 1972,[4] towards the end of the Ziggy Stardust sessions, 'Suffragette City' features a piano riff heavily influenced by Little Richard, a lyrical reference to the book and film A Clockwork Orange (the word 'droogie,' meaning 'friend') and the sing-along hook 'wham bam, thank you, ma'am!'",
    "source": "https://en.wikipedia.org/wiki/Suffragette_City",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": true,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  },  {
    "name": "Rock 'n' Roll Suicide",
    "audioUrl": "",
    "length": "2:58",
    "genre": "glam rock",
    "description": "Often used as a closing song for the Ziggy and Aladdin Sane tours, Rock ‘N’ Roll Suicide is not only the thematic death of Ziggy Stardust on the album, but the real life end to the character as portrayed by Bowie. \nBefore playing the song at The Hammersmith Odeon in London (The last date of the tour), Bowie announced… \n“Of all of the shows on this tour, this particular show will remain with us the longest because not only is it–not only is it the last show of the tour, but it’s the last show that we’ll ever do. Thank you.” \nWith this, the Ziggy Stardust era had ended. The only member of the band to know David was going to do this was Mick Ronson. \nThe song, in the context of the album depicts the final fall of Ziggy Stardust – the washed up superstar as the crushing weight of stardom and the rock n roll lifestyle (highlighted in Suffragette City the preceding song) takes its toll. \nHowever on its own the song tells another story. Away from the extremely loose narrative of the rock opera it is an incredibly powerful song, about watching someone close to you as they struggle with their problems and deal with depression. the crescendo throughout the song (starting with a simple acoustic chord and building to a quasi orchestral climax) is symbolic of the growing problems in the person, starting off as a mild cynicism or depression before spiraling down into the depths of helplessness. This is exacerbated by Bowie’s increasingly desperate lyrics and attempts to reach out and connect with this unknown person. \nRock ‘n’ Roll Suicide has a grand sense of staged drama previously unheard of in rock & roll.",
    "source": "https://genius.com/David-bowie-rock-n-roll-suicide-lyrics",
    "releaseDate": "06-16-1972",
    "songwriter": "David Bowie",
    "single": true,
    "bowie": "Ziggy Stardust",
    "album": "The Rise and Fall of Ziggy Stardust and the Spiders from Mars"
  }
]
